1(1 + 3) ** 5 / 2;
33 % 2;
0 / 0;
1 + NaN;
let numScore = 5;
numScore;
numScore = numScore + 1;
numScore += 1;
numScore++;
const weekNumber = 7;
true;
false;
let studentMember = 30;
//연산 순서는 괄호>제곱>곱셈/나눗셈>덧셈/뺄셈
//나머지를 나타내는 공식도 있다. (다른 언어랑 다르게 숫자를 나타내는 데이터는 오로지 하나이다.)
//숫자열에 NaN은 NotaNumber의 약자이다. typeof NaN을 입력하면 number로 출력되는데 이건 NaN도 숫자열로 취급한다는 의미이다.
//숫자 변수를 업데이트하는 2가지 방법이다.
//숫자 변수를 업데이트 하지만 첫 출력값은 기존숫자로 출력하고 2번쨰 출력값부터 적용
//변수 지정 방법에 const도 있는데 이건 불변값을 지정한다. (업데이트를 할 수 없다.) 그 외에도 var을 입력해서 지정할 수 있다.
//불리언 값이며 True False를 쓰면 type에러가 나타난다 불리언을 쓰는 이유는 참 거짓 값만 다루기 때문에 숫자와 문자와 달리 메모리를 많이 차지하지 않기 때문이다.
//변수이름을 지정할 때 띄어쓰기랑 숫자로 시작해서는 안된다. 그리고 카멜케이스를 많이 쓴다.(위에 내가 써놨음) 또 일반적인 규칙을 따르려면 이해하기 쉬운 변수이름으로 쓸 것!
